Examinator/src/InformationRegisters/РубрикиОбъектовСУЗ/РубрикиОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РубрикиОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рубрикатор</name>
    <type>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементРубрикатора</name>
    <type>
      <types>CatalogRef.ЭлементыРубрикатораСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РубрикиОбъектовСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура УдалитьЭлемент(Рубрикатор, ЭлементРубрикатора, СсылкаНаОбъектСУЗ, Поставщик = Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.РубрикиОбъектовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
	НаборЗаписей.Отбор.ЭлементРубрикатора.Установить(ЭлементРубрикатора);
	Если Поставщик <> Неопределено Тогда
		НаборЗаписей.Отбор.Поставщик.Установить(Поставщик);
	КонецЕсли;
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаОбъектСУЗ);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДобавитьЭлемент(Рубрикатор, ЭлементРубрикатора, СсылкаНаОбъектСУЗ, Поставщик = Неопределено) Экспорт
	
	Если Поставщик = Неопределено Тогда
		Поставщик = РазработкаСУЗ.ПолучитьПредпочитаемогоПоставщика();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РубрикиОбъектовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
	НаборЗаписей.Отбор.ЭлементРубрикатора.Установить(ЭлементРубрикатора);
	НаборЗаписей.Отбор.Поставщик.Установить(Поставщик);
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаОбъектСУЗ);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Рубрикатор         = Рубрикатор;
	НоваяЗапись.ЭлементРубрикатора = ЭлементРубрикатора;
	НоваяЗапись.Поставщик          = Поставщик;
	НоваяЗапись.СсылкаНаОбъектСУЗ  = СсылкаНаОбъектСУЗ;
	НоваяЗапись.ДатаИзменения      = ТекущаяДата();
	НоваяЗапись.ВесВопроса         = 1;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ДобавитьЭлементы(Рубрикатор, ЭлементРубрикатора, МассивЭлементов, Поставщик = Неопределено) Экспорт
	
	Если Поставщик = Неопределено Тогда
		Поставщик = РазработкаСУЗ.ПолучитьПредпочитаемогоПоставщика();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.РубрикиОбъектовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
	НаборЗаписей.Отбор.ЭлементРубрикатора.Установить(ЭлементРубрикатора);
	НаборЗаписей.Отбор.Поставщик.Установить(Поставщик);
	
	НаборЗаписей.Прочитать();
	
	Для каждого СсылкаНаЭлемент Из МассивЭлементов Цикл
		
		НайденаЗапись = Ложь;
		
		Для каждого ТекущаяЗапись Из НаборЗаписей Цикл		
			Если ТекущаяЗапись.СсылкаНаОбъектСУЗ = СсылкаНаЭлемент Тогда
				НайденаЗапись = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НайденаЗапись Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Рубрикатор         = Рубрикатор;
		НоваяЗапись.ЭлементРубрикатора = ЭлементРубрикатора;
		НоваяЗапись.Поставщик          = Поставщик;
		НоваяЗапись.СсылкаНаОбъектСУЗ  = СсылкаНаЭлемент;
		НоваяЗапись.ДатаИзменения      = ТекущаяДата();
		НоваяЗапись.ВесВопроса         = 1;	
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура Перезаписать(ЭлементРубрикатора, ПоставщикРубрики, СсылкаНаОбъектСУЗ, ВесВопроса) Экспорт
	
	Рубрикатор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементРубрикатора, "Владелец");
	
	НаборЗаписей = РегистрыСведений.РубрикиОбъектовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
	НаборЗаписей.Отбор.ЭлементРубрикатора.Установить(ЭлементРубрикатора);
	НаборЗаписей.Отбор.Поставщик.Установить(ПоставщикРубрики);
	НаборЗаписей.Отбор.СсылкаНаОбъектСУЗ.Установить(СсылкаНаОбъектСУЗ);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Рубрикатор = Рубрикатор;
	НоваяЗапись.ЭлементРубрикатора = ЭлементРубрикатора;
	НоваяЗапись.Поставщик = ПоставщикРубрики;
	НоваяЗапись.СсылкаНаОбъектСУЗ = СсылкаНаОбъектСУЗ;
	
	НоваяЗапись.ДатаИзменения = ТекущаяДата();
	НоваяЗапись.ВесВопроса = ВесВопроса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция РубрикиЭлемента(Рубрикатор, СсылкаНаОбъектСУЗ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РубрикиОбъектовСУЗ.ЭлементРубрикатора КАК ЭлементРубрикатора
		|ИЗ
		|	РегистрСведений.РубрикиОбъектовСУЗ КАК РубрикиОбъектовСУЗ
		|ГДЕ
		|	РубрикиОбъектовСУЗ.СсылкаНаОбъектСУЗ = &СсылкаНаОбъектСУЗ
		|	И РубрикиОбъектовСУЗ.Рубрикатор = &Рубрикатор";
	
	Запрос.УстановитьПараметр("Рубрикатор", Рубрикатор);
	Запрос.УстановитьПараметр("СсылкаНаОбъектСУЗ", СсылкаНаОбъектСУЗ);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭлементРубрикатора");
	
КонецФункции

#КонецОбласти


#КонецЕсли
